1.7speed/lesChannelCase_1.7_speed/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;    location "0";
    object U;
}

dimensions [0 1 -1 0 0 0 0];

internalField uniform (0.0 0.0 0.0);

boundaryField
{
    inlet
    {
    
        type fixedValue;
    
        value uniform (1.7 0.0 0.0);
    }
    outlet
    {
    
        type zeroGradient;
    }
    upperWall
    {
    
        type noSlip;
    }
    lowerWall
    {
    
        type noSlip;
    }
    frontAndBack
    {
    
        type empty;
    }
}
