1.7speed/lesChannelCase_1.7_speed/0/nut
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;    location "0";
    object nut;
}

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0.0;

boundaryField
{
    inlet
    {
    
        type calculated;
    
        value uniform 0.0;
    }
    outlet
    {
    
        type calculated;
    
        value uniform 0.0;
    }
    upperWall
    {
    
        type nutkWallFunction;
    
        value uniform 0.0;
    }
    lowerWall
    {
    
        type nutkWallFunction;
    
        value uniform 0.0;
    }
    frontAndBack
    {
    
        type empty;
    }
}
