1.7speed/lesChannelCase_1.7_speed/system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object controlDict;
}

application pimpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 2.0;

deltaT 0.0001;

writeControl adjustableRunTime;

writeInterval 0.01;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression no;

timeFormat general;

timePrecision 6;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo 5.0;
